{
  "You arrive on the scene of a 67-year-old male who is unconscious. As you approach the patient, you hear loud gurgling sounds coming from his airway. His respirations are shallow and rapid. What is your immediate next step?": "C. Suction the airway for no more than 15 seconds.",
  "A 22-year-old female is experiencing an asthma attack. She is speaking in one-word sentences, looks exhausted, and her lips are turning blue (cyanosis). You can barely hear wheezing because very little air is moving. Your partner is preparing oxygen. What is the most appropriate intervention?": "B. Assist ventilations with a Bag-Valve Mask (BVM).",
  "You and your partner are performing CPR on a 50-year-old male. An AED has just been attached and indicates 'Analyzing Heart Rhythm.' What should you do immediately?": "C. Stop CPR and ensure no one is touching the patient.",
  "You are treating a 60-year-old female complaining of crushing chest pain radiating to her left arm. She has a prescription for nitroglycerin. Her blood pressure is 90/60 mmHg, and her heart rate is 110. What is your next action regarding medication?": "B. Administer aspirin only; withhold nitroglycerin.",
  "A 25-year-old male was stabbed in the right side of the chest. He is gasping for air, and you note pink, frothy blood bubbling from the wound site every time he exhales. What is the immediate treatment for this injury?": "C. Apply an occlusive dressing taped on three sides.",
  "You are treating a patient who was thrown from a motorcycle. He has a rapid, weak radial pulse, pale and cool skin, and a respiratory rate of 28. His blood pressure is 100/70. Based on these signs, what stage of shock is he likely in?": "A. Compensated shock.",
  "You are called to a park for a 7-year-old boy who was stung by a bee. The boy has hives on his chest and arms, his face is swollen, and you hear audible stridor when he breathes. His mother has an EpiPen prescribed to him. What is the most significant sign that indicates the need for epinephrine?": "D. The respiratory compromise (stridor).",
  "A 30-year-old female is 34 weeks pregnant. She complains of a sudden onset of severe abdominal pain and bright red vaginal bleeding. Her abdomen is rigid to the touch. What condition do you suspect?": "B. Abruptio placentae.",
  "You are the first unit to arrive at a multi-vehicle collision on a highway. You see smoke coming from one vehicle and fluids leaking on the ground. Three patients are visible. What is your first priority?": "C. Positioning your ambulance to block traffic and ensuring scene safety.",
  "A competent 45-year-old male is complaining of chest pain but refuses transport to the hospital. You have explained the risks of refusal, including death, but he remains adamant. What must you do before leaving the scene?": "C. Document the refusal, the education provided, and have a witness sign the form if possible.",
  "You respond to a call for a 45-year-old male who is confused and agitated. His skin is pale, cool, and diaphoretic (sweaty). His wife states he has a history of Type 1 diabetes and took his insulin this morning but missed lunch. What is the most likely underlying cause of his condition?": "Hypoglycemia (Low blood sugar).",
  "A 20-year-old male was struck in the temporal region of the head with a baseball bat. He is unconscious. His vital signs are: Blood Pressure 180/100, Pulse 50, and Respirations are irregular. These vital signs (Cushing's Triad) indicate which condition?": "Increased Intracranial Pressure (ICP).",
  "You are treating a 3-year-old child who presents with a low-grade fever and a distinct 'seal-bark' cough. The parents state the symptoms worsen at night. The child is sitting upright but is not in severe distress. What condition do you suspect?": "Croup (Laryngotracheobronchitis).",
  "You arrive at the scene of a chemical plant where an alarm is sounding. You see several people collapsed near a leaking tank. The wind is blowing towards you. What is your immediate action?": "Retreat to a safe distance, uphill and upwind.",
  "A patient has sustained severe full-thickness burns covering his entire chest and both arms. The fire has been extinguished. After stopping the burning process and ensuring the airway is clear, how should you dress these wounds?": "Apply dry, sterile dressings.",
  "You are treating a 55-year-old male with chest pain. His Blood Pressure is 130/80. You are preparing to administer Nitroglycerin. Before doing so, you must confirm he has not taken which class of medication in the last 24-48 hours?": "Erectile dysfunction medications (PDE-5 inhibitors like Viagra or Cialis).",
  "A 70-year-old male with a long history of emphysema (COPD) complains of severe shortness of breath. His oxygen saturation is 82%. You recall learning about 'hypoxic drive.' What is the correct course of action regarding oxygen administration?": "Administer oxygen immediately; never withhold oxygen from a hypoxic patient in respiratory distress.",
  "During the assessment of a 72-year-old female with slurred speech, you ask her to close her eyes and hold her arms out with palms up. You notice the left arm drifts down. This test is a component of which assessment tool?": "The Cincinnati Prehospital Stroke Scale.",
  "You are assisting with a field delivery. As the baby's head emerges, you notice the umbilical cord is wrapped loosely around the baby's neck (nuchal cord). What is your first action?": "Attempt to gently slip the cord over the baby's head.",
  "A 24-year-old male has just stopped seizing. He is unconscious, breathing deeply and heavily (snoring respirations), and is drooling. What is the best position to place this patient in to maintain his airway?": "Lateral recumbent position (Recovery position).",
  "You are treating a 65-year-old male with chest pain. He has a prescription for nitroglycerin. You obtain a blood pressure of 90/60 mmHg. Why is nitroglycerin contraindicated in this patient?": "Nitroglycerin is a vasodilator and will further lower the blood pressure, potentially causing cardiovascular collapse.",
  "A 54-year-old female complains of sudden chest pressure and shortness of breath. She has pink, frothy sputum at the corners of her mouth and crackles (rales) in her lung bases. What condition do you suspect?": "Congestive Heart Failure (specifically Pulmonary Edema).",
  "You are performing 2-rescuer CPR on an infant. What is the correct compression-to-ventilation ratio?": "15 compressions to 2 ventilations.",
  "While managing a patient in cardiac arrest, you achieve Return of Spontaneous Circulation (ROSC). The patient remains unconscious and is not breathing adequately. What is your immediate next step?": "Begin artificial ventilations at a rate of 10-12 breaths per minute and monitor for a pulse.",
  "A patient describes their chest pain as a 'tearing' sensation radiating to their back between the shoulder blades. They have unequal radial pulse strengths. What life-threatening condition do you suspect?": "Dissecting Aortic Aneurysm.",
  "You are treating a patient with signs of a heart attack. You are preparing to administer aspirin. What is the correct dosage and method of administration according to most EMT protocols?": "162 mg to 324 mg (2-4 baby aspirins), chewed and swallowed.",
  "What is the primary electrical disturbance usually found in sudden cardiac arrest that an AED is designed to correct?": "Ventricular Fibrillation (V-Fib).",
  "You are assessing an elderly female with weakness and fatigue. She has noticeable swelling (edema) in her lower legs and feet (pedal edema) and jugular vein distension (JVD). Which side of the heart is likely failing?": "The Right side (Right-sided Heart Failure).",
  "During CPR, you feel ribs break under your hands. What should you do?": "Re-check your hand placement and continue compressions immediately.",
  "A 45-year-old male is in cardiac arrest. He has an internal pacemaker implanted in his upper left chest. How should you apply the AED pads?": "Place the AED pads at least one inch away from the pacemaker device.",
  "A 19-year-old female is found unconscious. Her breathing is deep and rapid (Kussmaul respirations), and her breath has a fruity, acetone odor. Her skin is warm and dry. What diabetic emergency is she likely experiencing?": "Diabetic Ketoacidosis (DKA) / Hyperglycemia.",
  "You are treating a patient who is actively seizing. What is your primary concern during the tonic-clonic phase?": "Protecting the patient from injury and ensuring the airway remains open/clear after the seizure stops.",
  "A 40-year-old male complains of severe pain in his right lower quadrant (RLQ) of the abdomen. He has a low-grade fever and nausea. What condition is most probable?": "Appendicitis.",
  "You are assessing a patient with a possible stroke. You ask him to smile, and the left side of his face droops. This is a criterion of which stroke assessment scale?": "The Cincinnati Prehospital Stroke Scale.",
  "A 25-year-old male is found unresponsive with pinpoint pupils and shallow, slow respirations. You observe track marks on his arms. What medication is indicated for this patient?": "Naloxone (Narcan).",
  "A patient experiencing a severe allergic reaction (anaphylaxis) has low blood pressure and difficulty breathing. Which medication is the priority intervention?": "Epinephrine (Adrenaline).",
  "A 30-year-old female complains of a sudden, severe headache that she describes as 'the worst headache of my life.' What condition should you suspect?": "Hemorrhagic Stroke (Subarachnoid Hemorrhage).",
  "You are called for a 'behavioral emergency.' The patient is acting intoxicated, slurring speech, and is combative, but you smell no alcohol. What medical condition must you rule out immediately?": "Hypoglycemia (Low blood sugar).",
  "A landscaper has been working in hot weather all day. He is confused, has hot, dry skin, and is no longer sweating. What environmental emergency is this?": "Heat Stroke.",
  "A patient has ingested a bottle of drain cleaner (a strong alkali). Why is Activated Charcoal contraindicated in this scenario?": "Charcoal is ineffective against strong acids/alkalis, and the substance may cause further damage if the patient vomits.",
  "A 22-year-old male has a large open wound on his neck that is bubbling. What type of dressing must be applied immediately?": "An occlusive dressing.",
  "You are treating a patient with a closed head injury. You notice his blood pressure is rising (hypertension) and his heart rate is slowing (bradycardia). What is this combination of signs called?": "Cushing's Triad (indicative of Increased Intracranial Pressure).",
  "A construction worker has a metal rod impaled through his right cheek, obstructing his airway and causing heavy bleeding into the mouth. What is the correct way to manage this impaled object?": "Remove the object because it obstructs the airway, then control bleeding.",
  "You arrive at a scene where a man has partial intestinal evisceration following a knife wound. How should you dress this injury?": "Cover with a moist, sterile dressing, then cover with an occlusive dressing to keep it warm and prevent drying.",
  "A patient has been shot in the thigh and has bright red blood spurting from the wound. Direct pressure has failed to stop the bleeding. What is your next step?": "Apply a tourniquet proximal to the injury (above the wound) until bleeding stops.",
  "A hockey player took a heavy hit to the chest and immediately went into cardiac arrest. What is this phenomenon called?": "Commotio Cordis.",
  "You are treating a patient with a suspected femur fracture. Under what specific circumstance is the application of a traction splint contraindicated?": "If there is a suspected injury to the knee, hip, or lower leg/ankle on the same side.",
  "A burn victim has partial-thickness burns to the entire front of his torso (chest and abdomen) and the entire front of one arm. According to the Rule of Nines, what percentage of his body surface area is burned?": "22.5% (18% for anterior torso + 4.5% for anterior arm).",
  "A patient has bruising behind the ears (Battle's sign) and around the eyes (Raccoon eyes). What type of injury does this indicate?": "Basilar Skull Fracture.",
  "You are treating a patient with a nosebleed (epistaxis). In what position should you place the patient?": "Sitting up and leaning forward.",
  "You hear a high-pitched whistling sound upon exhalation when assessing a patient's lung sounds. What is this sound, and what does it indicate?": "Wheezing; indicates constriction of the lower airways (bronchoconstriction), common in asthma.",
  "A 4-year-old child presents with a fever, drooling, and is sitting in a tripod position. You suspect Epiglottitis. What action must you strictly avoid?": "Do not insert anything into the mouth (like a tongue depressor or OPA) as it may cause a laryngospasm and total airway obstruction.",
  "What is the proper way to size an Oropharyngeal Airway (OPA)?": "Measure from the corner of the mouth to the earlobe (or angle of the jaw).",
  "You are ventilating an adult patient with a Bag-Valve Mask (BVM). What is the appropriate rate of ventilation?": "1 breath every 5 to 6 seconds (10-12 breaths/min).",
  "A tall, thin 20-year-old male complains of sudden sharp chest pain and shortness of breath after coughing. Lung sounds are diminished on the right side. What condition do you suspect?": "Spontaneous Pneumothorax.",
  "You are suctioning an adult patient's airway. What is the maximum duration you should apply suction at one time?": "15 seconds.",
  "A patient with COPD is drowsy and has an oxygen saturation of 88%. You are concerned about the 'hypoxic drive.' Should you withhold oxygen?": "No. Never withhold oxygen from a patient in respiratory distress or failure. Administer oxygen and monitor ventilations.",
  "What is the primary contraindication for using a Nasopharyngeal Airway (NPA)?": "Severe head injury or signs of a basilar skull fracture (e.g., fluid draining from ears/nose).",
  "You hear coarse, rattling sounds in the lungs of a patient with pneumonia. What is this lung sound called?": "Rhonchi.",
  "A patient is hyperventilating due to anxiety and complains of numbness and cramping in their hands and fingers (carpopedal spasm). How should you treat this?": "Coach the patient to slow their breathing; do not have them breathe into a paper bag."
}