{
  "You hear coarse, rattling sounds in the lungs of a patient with pneumonia. What is this lung sound called?": "Rhonchi.",
  "A patient is hyperventilating due to anxiety and complains of numbness and cramping in their hands and fingers (carpopedal spasm). How should you treat this?": "Coach the patient to slow their breathing; do not have them breathe into a paper bag.",
  "A 45-year-old male is experiencing chest pain, diaphoresis, and shortness of breath. His blood pressure is 90/60 mmHg. What is the MOST appropriate first action?": "Administer high-flow oxygen and prepare for rapid transport while monitoring vital signs.",
  "What is the normal respiratory rate for an adult at rest?": "12-20 breaths per minute",
  "You arrive on scene to find an unresponsive patient. After ensuring scene safety, what is your next step?": "Check for responsiveness and call for help/activate EMS if not already done.",
  "A patient has a blood pressure of 88/56 mmHg, heart rate of 120 bpm, and cool, clammy skin. What condition do these signs indicate?": "Shock (hypoperfusion)",
  "What is the correct compression-to-ventilation ratio for single-rescuer adult CPR?": "30:2",
  "When using an AED, what should you do if the patient has a medication patch on their chest?": "Remove the patch and wipe the area clean before applying the AED pads.",
  "A patient is alert but experiencing a severe allergic reaction with hives and wheezing. What medication may you assist with or administer?": "Epinephrine auto-injector (EpiPen)",
  "What does the acronym SAMPLE stand for in patient assessment?": "Signs/Symptoms, Allergies, Medications, Past medical history, Last oral intake, Events leading up to the incident",
  "At what rate should chest compressions be performed during adult CPR?": "100-120 compressions per minute",
  "A patient presents with slurred speech, facial drooping on one side, and arm weakness. What condition should you suspect?": "Stroke (cerebrovascular accident)",
  "What is the Glasgow Coma Scale range?": "3-15",
  "When should you use a non-rebreather mask?": "When a patient requires high-concentration oxygen delivery (10-15 LPM for 90%+ oxygen concentration)",
  "What is the preferred method for opening the airway in a patient with suspected spinal injury?": "Jaw-thrust maneuver",
  "A diabetic patient is conscious but confused with cool, clammy skin. Blood glucose reads 54 mg/dL. What should you administer?": "Oral glucose",
  "What does OPQRST stand for when assessing pain?": "Onset, Provocation, Quality, Radiation, Severity, Time",
  "What is the maximum time an EMT should spend on scene with a critical trauma patient?": "10 minutes or less (Platinum 10 minutes/Golden Hour principle)",
  "A child has a partial airway obstruction and is coughing forcefully. What is the appropriate action?": "Encourage continued coughing and do not interfere; monitor closely.",
  "What is the normal blood glucose range?": "70-100 mg/dL (fasting) or approximately 80-120 mg/dL",
  "When treating a patient with suspected spinal injury, how should you immobilize them?": "Manual in-line stabilization, apply cervical collar, and secure to a backboard or appropriate spinal motion restriction device.",
  "What are the signs of adequate breathing in an adult?": "Rate of 12-20 breaths/min, adequate tidal volume, regular rhythm, bilateral chest rise, and clear breath sounds.",
  "A patient has been stung by a bee and is now experiencing difficulty breathing and widespread hives. What is this condition called?": "Anaphylaxis",
  "What is the proper depth for chest compressions in an adult?": "At least 2 inches (5 cm) but no more than 2.4 inches (6 cm)",
  "What are the 'Hs and Ts' that represent reversible causes of cardiac arrest?": "Hypovolemia, Hypoxia, Hydrogen ion (acidosis), Hypo/Hyperkalemia, Hypothermia, Tension pneumothorax, Tamponade (cardiac), Toxins, Thrombosis (pulmonary/coronary)",
  "How should you treat a patient with an evisceration (abdominal organs protruding)?": "Cover with a sterile dressing moistened with saline, do not attempt to push organs back in, and keep the patient warm.",
  "What is the appropriate oxygen flow rate for a nasal cannula?": "1-6 liters per minute",
  "A patient with COPD history is in respiratory distress. What is the initial oxygen administration approach?": "Start with lower concentration and titrate to maintain SpO2 of 88-92%, while closely monitoring respiratory effort.",
  "What position should a patient in shock be placed in (if no spinal injury is suspected)?": "Supine with legs elevated (Trendelenburg or shock position)",
  "When is it appropriate to use an oropharyngeal airway (OPA)?": "In unconscious patients with no gag reflex",
  "What is the APGAR score used for?": "Assessing newborn vital signs at 1 and 5 minutes after birth (Appearance, Pulse, Grimace, Activity, Respirations)",
  "A construction worker has an impaled object in his thigh. How should you manage this?": "Stabilize the object in place with bulky dressings, do not remove it, and transport.",
  "What is the Rule of 9s used for in emergency medicine?": "To estimate the total body surface area (TBSA) affected by burns in order to assess burn severity and guide treatment.",
  "According to the adult Rule of 9s, what percentage does the entire head and neck represent?": "9%",
  "According to the adult Rule of 9s, what percentage does each upper extremity (arm) represent?": "9% each",
  "According to the adult Rule of 9s, what percentage does the anterior trunk (chest and abdomen) represent?": "18%",
  "According to the adult Rule of 9s, what percentage does the posterior trunk (back) represent?": "18%",
  "According to the adult Rule of 9s, what percentage does each lower extremity (leg) represent?": "18% each",
  "According to the adult Rule of 9s, what percentage does the genital/perineal area represent?": "1%",
  "An adult patient has burns covering the entire anterior chest, entire abdomen, and entire right arm. Using the Rule of 9s, what is the estimated TBSA burned?": "27% (anterior trunk 18% + right arm 9%)",
  "An adult has burns to the entire back and the entire left leg. What is the TBSA affected?": "36% (posterior trunk 18% + left leg 18%)",
  "How does the Rule of 9s differ for infants and young children compared to adults?": "In infants/children, the head represents a larger percentage (18%) and each leg represents a smaller percentage (14%), due to different body proportions.",
  "What is the 'palmar method' for estimating burn surface area?": "The patient's palm (including fingers) represents approximately 1% of their total body surface area, useful for estimating scattered or irregular burns.",
  "An adult patient has burns to the entire front of both legs and the genital area. What is the estimated TBSA?": "19% (anterior right leg 9% + anterior left leg 9% + genitals 1%)",
  "At what TBSA percentage is a burn generally considered critical in an adult?": "Burns greater than 20-25% TBSA, or greater than 10% TBSA if full-thickness (third-degree)",
  "What three components are assessed in the Cincinnati Prehospital Stroke Scale?": "Facial droop, arm drift, and speech abnormalities",
  "How do you assess facial droop using the Cincinnati Prehospital Stroke Scale?": "Ask the patient to smile or show their teeth and observe if both sides of the face move equally.",
  "What is a normal finding when assessing facial droop in the Cincinnati Stroke Scale?": "Both sides of the face move equally and symmetrically.",
  "What is an abnormal finding when assessing facial droop in the Cincinnati Stroke Scale?": "One side of the face does not move as well as the other, or droops.",
  "How do you assess arm drift using the Cincinnati Prehospital Stroke Scale?": "Ask the patient to close their eyes and extend both arms straight out, palms up, for 10 seconds.",
  "What is a normal finding when assessing arm drift in the Cincinnati Stroke Scale?": "Both arms move equally, or neither arm moves/drifts.",
  "What is an abnormal finding when assessing arm drift in the Cincinnati Stroke Scale?": "One arm does not move, or one arm drifts downward compared to the other.",
  "How do you assess speech using the Cincinnati Prehospital Stroke Scale?": "Ask the patient to repeat a simple phrase such as 'You can't teach an old dog new tricks.'",
  "What is a normal finding when assessing speech in the Cincinnati Stroke Scale?": "The patient says the correct words clearly without slurring.",
  "What is an abnormal finding when assessing speech in the Cincinnati Stroke Scale?": "The patient slurs words, uses incorrect or inappropriate words, or is unable to speak.",
  "If a patient shows one abnormal finding on the Cincinnati Prehospital Stroke Scale, what is the probability they are having a stroke?": "Approximately 72%",
  "What does the mnemonic FAST stand for in stroke assessment?": "Face drooping, Arm weakness, Speech difficulty, Time to call 911",
  "What are the three categories assessed in the Glasgow Coma Scale (GCS)?": "Eye opening, verbal response, and motor response",
  "What is the total score range for the Glasgow Coma Scale?": "3 (minimum) to 15 (maximum)",
  "In the GCS, how many points are given for spontaneous eye opening?": "4 points",
  "In the GCS, how many points are given for eye opening to verbal command/voice?": "3 points",
  "In the GCS, how many points are given for eye opening to painful stimulus?": "2 points",
  "In the GCS, how many points are given for no eye opening?": "1 point",
  "In the GCS, how many points are given for an oriented verbal response?": "5 points",
  "In the GCS, how many points are given for a confused verbal response?": "4 points",
  "In the GCS, how many points are given for inappropriate words?": "3 points",
  "In the GCS, how many points are given for incomprehensible sounds?": "2 points",
  "In the GCS, how many points are given for no verbal response?": "1 point",
  "In the GCS, how many points are given for obeying motor commands?": "6 points",
  "In the GCS, how many points are given for localizing pain (purposeful movement toward stimulus)?": "5 points",
  "In the GCS, how many points are given for withdrawing from pain?": "4 points",
  "In the GCS, how many points are given for abnormal flexion (decorticate posturing)?": "3 points",
  "In the GCS, how many points are given for extension (decerebrate posturing)?": "2 points",
  "In the GCS, how many points are given for no motor response?": "1 point",
  "What GCS score range indicates severe brain injury?": "3-8",
  "What GCS score range indicates moderate brain injury?": "9-12",
  "What GCS score range indicates mild/minor brain injury?": "13-15",
  "A patient opens eyes to voice, is confused when speaking, and obeys commands. What is their GCS score?": "13 (Eye 3 + Verbal 4 + Motor 6)",
  "A patient opens eyes only to pain, makes incomprehensible sounds, and withdraws from pain. What is their GCS score?": "8 (Eye 2 + Verbal 2 + Motor 4)",
  "A patient is unresponsive with no eye opening, no verbal response, and exhibits decerebrate posturing. What is their GCS score?": "4 (Eye 1 + Verbal 1 + Motor 2)",
  "A patient opens eyes spontaneously, is oriented, and obeys commands. What is their GCS score?": "15 (Eye 4 + Verbal 5 + Motor 6)",
  "At what GCS score is endotracheal intubation often considered for airway protection?": "GCS of 8 or less",
  "What is decorticate posturing and what does it indicate?": "Arms flexed and drawn toward the core with legs extended; indicates damage to the cerebral hemispheres or area above the brainstem.",
  "What is decerebrate posturing and what does it indicate?": "Arms and legs extended with arms rotated inward; indicates damage to the brainstem and is generally a worse prognostic sign than decorticate posturing.",
  "How do you document a GCS score?": "Report the total score and individual component scores (e.g., GCS 11 = E3 V4 M4)",
  "Why is it important to document individual GCS component scores rather than just the total?": "Individual scores provide more specific information about the patient's neurological status and help track changes in specific functions over time."
}