{
  "What does the standards say about configurable values?": "Configurable values (values which may change later) should be extracted from code and placed in configuration files.",
  "What must be done regarding third-party libraries?": "Any third-party libraries (NuGet, npm, dlls, JS libraries, etc.) must be approved by the CTO before use.",
  "What must be done regarding service interfaces?": "Interfaces for classes in a service must be added to the .Common project in that service.",
  "Where should IReportManager.cs reside?": "IReportManager.cs should be in Report.Common even though ReportManager.cs lives in Report.ClientService.",
  "Where should Unit Test projects be located?": "Unit Tests should live in the folder of the project they test and be named ProjectName.Tests.",
  "What should never be done regarding production secrets?": "Production secrets (API keys, connection strings, etc.) must NEVER be committed to source control.",
  "What does the standard say about config files in source control?": "Config files in source control should default to point to Cloud environments, not On-Prem.",
  "What environment should .NET apps default to?": "All .NET apps should be committed with DEV1 as the default environment configuration.",
  "What environment configuration should be uncommented in .NET Framework apps?": "DEV1 configuration should be uncommented in the config file by default.",
  "What must be done regarding single-line if blocks?": "Single-line if statements must be wrapped in braces for readability and maintainability.",
  "What is the rule for C# class naming?": "Class names use PascalCase and should be nouns that describe the object’s role.",
  "What is the naming convention for interfaces?": "Interfaces should not use an 'I' prefix unless adhering to .NET framework conventions.",
  "What is the naming convention for private fields?": "Private fields should use camelCase with a leading underscore, e.g., _userId.",
  "What is the naming convention for constants?": "Constants use PascalCase without underscores.",
  "What naming pattern should boolean-returning methods follow?": "Boolean methods should start with 'Is', 'Has', or 'Should'.",
  "What should methods that perform actions be named as?": "Action methods should begin with verbs like Get, Save, or Delete.",
  "What is the standard for file naming in JavaScript and CSS?": "Use kebab-case for filenames (e.g., machine-info.js, machine-info.css).",
  "What should be avoided in naming conventions?": "Avoid abbreviations unless universally understood.",
  "What is the rule about magic numbers?": "Avoid magic numbers; use constants or enumerations instead.",
  "What is the guideline for exception handling?": "Exceptions must be logged and handled appropriately, never silently ignored.",
  "What is the rule about rethrowing exceptions?": "If rethrowing an exception, use 'throw;' to preserve the original stack trace.",
  "What must be done regarding logging?": "Use structured logging and include relevant context information.",
  "What is the rule about using SELECT * in SQL?": "Avoid SELECT *; specify explicit columns for clarity and performance.",
  "What is the standard for time zones?": "Store and transmit all DateTime values in UTC.",
  "How should UTC and local times be named?": "Append 'Utc' or 'Local' to property names to indicate their kind.",
  "What should be the default DateTimeKind in code?": "Always set DateTimeKind to Utc for persisted timestamps.",
  "What should be avoided when building SQL queries?": "Avoid string concatenation; use parameterized queries instead.",
  "What should be avoided regarding LINQ-to-Entities?": "Avoid calling non-translatable functions inside LINQ-to-Entities queries.",
  "What must be done regarding migrations?": "Database migrations must be reviewed and version-controlled.",
  "What should unit tests return on failure?": "Tests must fail explicitly using Assert methods, not silent conditions.",
  "What is the naming pattern for test projects?": "Test projects should follow the format ProjectName.Tests.",
  "What is the naming pattern for test classes?": "Test class names should match the class under test with 'Tests' appended.",
  "What does the standard say about console logging in production?": "Avoid using console.log in production; use a logging framework instead.",
  "What should AJAX requests use for JSON bodies?": "Set contentType to application/json and serialize data with JSON.stringify().",
  "What is the standard for handling long-running requests?": "Support cancellation tokens and terminate server work when the client aborts.",
  "What is the guideline for configuration by environment?": "Use environment-based config files (e.g., appsettings.Dev1.json, appsettings.Prod.json).",
  "What is the rule for dependency injection?": "All services should use dependency injection; avoid service locators.",
  "What must be done for service registrations?": "Register interfaces and their implementations explicitly in the startup configuration.",
  "What is the standard for comments?": "Use comments to explain 'why' not 'what'—code should be self-explanatory.",
  "What is the rule for method length?": "Methods should be concise and fit within one screen (≈30 lines max).",
  "What must be done regarding class responsibility?": "Each class should have a single, clear responsibility (SRP).",
  "What should be done before committing code?": "Run all unit tests and static analysis; ensure zero warnings and code smells.",
  "What should be avoided when naming folders?": "Avoid spaces and special characters in folder names.",
  "What is the rule about null returns in collections?": "Never return null collections; return an empty list or enumerable instead.",
  "What is the standard for version control branching?": "Use feature branches and meaningful names (feature/add-new-report).",
  "What is the guideline for commit messages?": "Commit messages should be imperative and describe the change (e.g., 'Add new report filter').",
  "What is the rule for application logging?": "Log exceptions at the source and include correlation IDs for tracing.",
  "What should be avoided in log messages?": "Avoid logging sensitive information such as user credentials or tokens.",
  "What is the standard for error codes?": "Use consistent error codes and messages across APIs.",
  "What is the rule for CORS configuration?": "Only allow trusted origins in CORS settings; never use '*'.",
  "What should be used to store sensitive configuration?": "Store secrets in Azure Key Vault or secure environment variables.",
  "What is the rule for pull requests?": "All pull requests must have peer review and CI validation before merge.",
  "What should be done when refactoring?": "Ensure refactors do not change behavior and retain passing test coverage.",
  "What must be done regarding coding style enforcement?": "Use .editorconfig and stylecop.json to enforce consistent code formatting.",
  "What is the rule for method parameter count?": "Avoid methods with more than 5 parameters; use DTOs when needed.",
  "What should be avoided in asynchronous methods?": "Avoid using async void; return Task or Task<T> instead.",
  "What is the rule for naming asynchronous methods?": "Append 'Async' to method names that use async/await."
}